#### Terraform Format and Style 🖌`success`
#### Terraform Initialization ⚙️`success`
#### Terraform Validation 🤖`success`
<details><summary>Validation Output</summary>

```

Success! The configuration is valid.


```

</details>

#### Terraform Plan 📖`success`

<details><summary>Show Plan</summary>

```

terraform
module.ec2.data.aws_partition.current: Reading...
module.ec2.data.aws_ssm_parameter.this[0]: Reading...
data.aws_availability_zones.available: Reading...
module.ec2.data.aws_partition.current: Read complete after 0s [id=aws]
module.ec2.data.aws_iam_policy_document.assume_role_policy[0]: Reading...
module.ec2.data.aws_iam_policy_document.assume_role_policy[0]: Read complete after 0s [id=1256122602]
module.ec2.data.aws_ssm_parameter.this[0]: Read complete after 0s [id=/aws/service/ami-amazon-linux-latest/amzn2-ami-hvm-x86_64-gp2]
data.aws_availability_zones.available: Read complete after 0s [id=us-east-1]
module.vpc_endpoints.data.aws_vpc_endpoint_service.this["ec2messages"]: Reading...
module.vpc_endpoints.data.aws_vpc_endpoint_service.this["ssmmessages"]: Reading...
module.vpc_endpoints.data.aws_vpc_endpoint_service.this["ssm"]: Reading...
module.vpc_endpoints.data.aws_vpc_endpoint_service.this["ec2messages"]: Read complete after 1s [id=2187510914]
module.vpc_endpoints.data.aws_vpc_endpoint_service.this["ssmmessages"]: Read complete after 1s [id=1315226949]
module.vpc_endpoints.data.aws_vpc_endpoint_service.this["ssm"]: Read complete after 1s [id=874300523]

Terraform used the selected providers to generate the following execution
plan. Resource actions are indicated with the following symbols:
  + create

Terraform will perform the following actions:

  # module.ec2.aws_iam_instance_profile.this[0] will be created
  + resource "aws_iam_instance_profile" "this" {
      + arn         = (known after apply)
      + create_date = (known after apply)
      + id          = (known after apply)
      + name        = (known after apply)
      + name_prefix = "iac-ci-cd-terraform-"
      + path        = "/"
      + role        = (known after apply)
      + tags        = {
          + "Name" = "iac-ci-cd-terraform"
        }
      + tags_all    = {
          + "CI"         = "true"
          + "Name"       = "iac-ci-cd-terraform"
          + "Project"    = "iac-ci-cd"
          + "Repository" = "https://github.com/clouderizando/iac-ci-cd"
          + "Terraform"  = "true"
        }
      + unique_id   = (known after apply)
    }

  # module.ec2.aws_iam_role.this[0] will be created
  + resource "aws_iam_role" "this" {
      + arn                   = (known after apply)
      + assume_role_policy    = jsonencode(
            {
              + Statement = [
                  + {
                      + Action    = "sts:AssumeRole"
                      + Effect    = "Allow"
                      + Principal = {
                          + Service = "ec2.amazonaws.com"
                        }
                      + Sid       = "EC2AssumeRole"
                    },
                ]
              + Version   = "2012-10-17"
            }
        )
      + create_date           = (known after apply)
      + description           = "IAM role for EC2 instance"
      + force_detach_policies = true
      + id                    = (known after apply)
      + managed_policy_arns   = (known after apply)
      + max_session_duration  = 3600
      + name                  = (known after apply)
      + name_prefix           = "iac-ci-cd-terraform-"
      + path                  = "/"
      + tags                  = {
          + "Name" = "iac-ci-cd-terraform"
        }
      + tags_all              = {
          + "CI"         = "true"
          + "Name"       = "iac-ci-cd-terraform"
          + "Project"    = "iac-ci-cd"
          + "Repository" = "https://github.com/clouderizando/iac-ci-cd"
          + "Terraform"  = "true"
        }
      + unique_id             = (known after apply)
    }

  # module.ec2.aws_iam_role_policy_attachment.this["AmazonSSMManagedInstanceCore"] will be created
  + resource "aws_iam_role_policy_attachment" "this" {
      + id         = (known after apply)
      + policy_arn = "arn:aws:iam::aws:policy/AmazonSSMManagedInstanceCore"
      + role       = (known after apply)
    }

  # module.ec2.aws_instance.this[0] will be created
  + resource "aws_instance" "this" {
      + ami                                  = "ami-0cf43e890af9e3351"
      + arn                                  = (known after apply)
      + associate_public_ip_address          = (known after apply)
      + availability_zone                    = (known after apply)
      + cpu_core_count                       = (known after apply)
      + cpu_threads_per_core                 = (known after apply)
      + disable_api_stop                     = (known after apply)
      + disable_api_termination              = (known after apply)
      + ebs_optimized                        = (known after apply)
      + get_password_data                    = false
      + host_id                              = (known after apply)
      + host_resource_group_arn              = (known after apply)
      + iam_instance_profile                 = (known after apply)
      + id                                   = (known after apply)
      + instance_initiated_shutdown_behavior = (known after apply)
      + instance_lifecycle                   = (known after apply)
      + instance_state                       = (known after apply)
      + instance_type                        = "t2.micro"
      + ipv6_address_count                   = (known after apply)
      + ipv6_addresses                       = (known after apply)
      + key_name                             = (known after apply)
      + monitoring                           = (known after apply)
      + outpost_arn                          = (known after apply)
      + password_data                        = (known after apply)
      + placement_group                      = (known after apply)
      + placement_partition_number           = (known after apply)
      + primary_network_interface_id         = (known after apply)
      + private_dns                          = (known after apply)
      + private_ip                           = (known after apply)
      + public_dns                           = (known after apply)
      + public_ip                            = (known after apply)
      + secondary_private_ips                = (known after apply)
      + security_groups                      = (known after apply)
      + source_dest_check                    = true
      + spot_instance_request_id             = (known after apply)
      + subnet_id                            = (known after apply)
      + tags                                 = {
          + "Name" = "iac-ci-cd-terraform"
        }
      + tags_all                             = {
          + "CI"         = "true"
          + "Name"       = "iac-ci-cd-terraform"
          + "Project"    = "iac-ci-cd"
          + "Repository" = "https://github.com/clouderizando/iac-ci-cd"
          + "Terraform"  = "true"
        }
      + tenancy                              = (known after apply)
      + user_data                            = (known after apply)
      + user_data_base64                     = (known after apply)
      + user_data_replace_on_change          = false
      + volume_tags                          = {
          + "Name" = "iac-ci-cd-terraform"
        }
      + vpc_security_group_ids               = (known after apply)

      + credit_specification {}

      + enclave_options {
          + enabled = (known after apply)
        }

      + metadata_options {
          + http_endpoint               = "enabled"
          + http_protocol_ipv6          = "disabled"
          + http_put_response_hop_limit = 1
          + http_tokens                 = "optional"
          + instance_metadata_tags      = (known after apply)
        }

      + timeouts {}
    }

  # module.security_group_instance.aws_security_group.this_name_prefix[0] will be created
  + resource "aws_security_group" "this_name_prefix" {
      + arn                    = (known after apply)
      + description            = "Security Group for EC2 Instance Egress"
      + egress                 = (known after apply)
      + id                     = (known after apply)
      + ingress                = (known after apply)
      + name                   = (known after apply)
      + name_prefix            = "iac-ci-cd-terraform-ec2-"
      + owner_id               = (known after apply)
      + revoke_rules_on_delete = false
      + tags                   = {
          + "Name" = "iac-ci-cd-terraform"
        }
      + tags_all               = {
          + "CI"         = "true"
          + "Name"       = "iac-ci-cd-terraform"
          + "Project"    = "iac-ci-cd"
          + "Repository" = "https://github.com/clouderizando/iac-ci-cd"
          + "Terraform"  = "true"
        }
      + vpc_id                 = (known after apply)

      + timeouts {
          + create = "10m"
          + delete = "15m"
        }
    }

  # module.security_group_instance.aws_security_group_rule.egress_rules[0] will be created
  + resource "aws_security_group_rule" "egress_rules" {
      + cidr_blocks              = [
          + "0.0.0.0/0",
        ]
      + description              = "HTTPS"
      + from_port                = 443
      + id                       = (known after apply)
      + ipv6_cidr_blocks         = [
          + "::/0",
        ]
      + prefix_list_ids          = []
      + protocol                 = "tcp"
      + security_group_id        = (known after apply)
      + security_group_rule_id   = (known after apply)
      + self                     = false
      + source_security_group_id = (known after apply)
      + to_port                  = 443
      + type                     = "egress"
    }

  # module.vpc.aws_default_network_acl.this[0] will be created
  + resource "aws_default_network_acl" "this" {
      + arn                    = (known after apply)
      + default_network_acl_id = (known after apply)
      + id                     = (known after apply)
      + owner_id               = (known after apply)
      + tags                   = {
          + "Name" = "iac-ci-cd-terraform"
        }
      + tags_all               = {
          + "CI"         = "true"
          + "Name"       = "iac-ci-cd-terraform"
          + "Project"    = "iac-ci-cd"
          + "Repository" = "https://github.com/clouderizando/iac-ci-cd"
          + "Terraform"  = "true"
        }
      + vpc_id                 = (known after apply)

      + egress {
          + action          = "allow"
          + from_port       = 0
          + ipv6_cidr_block = "::/0"
          + protocol        = "-1"
          + rule_no         = 101
          + to_port         = 0
        }
      + egress {
          + action     = "allow"
          + cidr_block = "0.0.0.0/0"
          + from_port  = 0
          + protocol   = "-1"
          + rule_no    = 100
          + to_port    = 0
        }

      + ingress {
          + action          = "allow"
          + from_port       = 0
          + ipv6_cidr_block = "::/0"
          + protocol        = "-1"
          + rule_no         = 101
          + to_port         = 0
        }
      + ingress {
          + action     = "allow"
          + cidr_block = "0.0.0.0/0"
          + from_port  = 0
          + protocol   = "-1"
          + rule_no    = 100
          + to_port    = 0
        }
    }

  # module.vpc.aws_default_route_table.default[0] will be created
  + resource "aws_default_route_table" "default" {
      + arn                    = (known after apply)
      + default_route_table_id = (known after apply)
      + id                     = (known after apply)
      + owner_id               = (known after apply)
      + route                  = (known after apply)
      + tags                   = {
          + "Name" = "iac-ci-cd-terraform"
        }
      + tags_all               = {
          + "CI"         = "true"
          + "Name"       = "iac-ci-cd-terraform"
          + "Project"    = "iac-ci-cd"
          + "Repository" = "https://github.com/clouderizando/iac-ci-cd"
          + "Terraform"  = "true"
        }
      + vpc_id                 = (known after apply)

      + timeouts {
          + create = "5m"
          + update = "5m"
        }
    }

  # module.vpc.aws_default_security_group.this[0] will be created
  + resource "aws_default_security_group" "this" {
      + arn                    = (known after apply)
      + description            = (known after apply)
      + egress                 = (known after apply)
      + id                     = (known after apply)
      + ingress                = (known after apply)
      + name                   = (known after apply)
      + name_prefix            = (known after apply)
      + owner_id               = (known after apply)
      + revoke_rules_on_delete = false
      + tags                   = {
          + "Name" = "iac-ci-cd-terraform"
        }
      + tags_all               = {
          + "CI"         = "true"
          + "Name"       = "iac-ci-cd-terraform"
          + "Project"    = "iac-ci-cd"
          + "Repository" = "https://github.com/clouderizando/iac-ci-cd"
          + "Terraform"  = "true"
        }
      + vpc_id                 = (known after apply)
    }

  # module.vpc.aws_route_table.intra[0] will be created
  + resource "aws_route_table" "intra" {
      + arn              = (known after apply)
      + id               = (known after apply)
      + owner_id         = (known after apply)
      + propagating_vgws = (known after apply)
      + route            = (known after apply)
      + tags             = {
          + "Name" = "iac-ci-cd-terraform"
        }
      + tags_all         = {
          + "CI"         = "true"
          + "Name"       = "iac-ci-cd-terraform"
          + "Project"    = "iac-ci-cd"
          + "Repository" = "https://github.com/clouderizando/iac-ci-cd"
          + "Terraform"  = "true"
        }
      + vpc_id           = (known after apply)
    }

  # module.vpc.aws_route_table_association.intra[0] will be created
  + resource "aws_route_table_association" "intra" {
      + id             = (known after apply)
      + route_table_id = (known after apply)
      + subnet_id      = (known after apply)
    }

  # module.vpc.aws_route_table_association.intra[1] will be created
  + resource "aws_route_table_association" "intra" {
      + id             = (known after apply)
      + route_table_id = (known after apply)
      + subnet_id      = (known after apply)
    }

  # module.vpc.aws_route_table_association.intra[2] will be created
  + resource "aws_route_table_association" "intra" {
      + id             = (known after apply)
      + route_table_id = (known after apply)
      + subnet_id      = (known after apply)
    }

  # module.vpc.aws_subnet.intra[0] will be created
  + resource "aws_subnet" "intra" {
      + arn                                            = (known after apply)
      + assign_ipv6_address_on_creation                = false
      + availability_zone                              = "us-east-1a"
      + availability_zone_id                           = (known after apply)
      + cidr_block                                     = "10.0.0.0/24"
      + enable_dns64                                   = false
      + enable_resource_name_dns_a_record_on_launch    = false
      + enable_resource_name_dns_aaaa_record_on_launch = false
      + id                                             = (known after apply)
      + ipv6_cidr_block_association_id                 = (known after apply)
      + ipv6_native                                    = false
      + map_public_ip_on_launch                        = false
      + owner_id                                       = (known after apply)
      + private_dns_hostname_type_on_launch            = (known after apply)
      + tags                                           = {
          + "Name" = "iac-ci-cd-terraform"
        }
      + tags_all                                       = {
          + "CI"         = "true"
          + "Name"       = "iac-ci-cd-terraform"
          + "Project"    = "iac-ci-cd"
          + "Repository" = "https://github.com/clouderizando/iac-ci-cd"
          + "Terraform"  = "true"
        }
      + vpc_id                                         = (known after apply)
    }

  # module.vpc.aws_subnet.intra[1] will be created
  + resource "aws_subnet" "intra" {
      + arn                                            = (known after apply)
      + assign_ipv6_address_on_creation                = false
      + availability_zone                              = "us-east-1b"
      + availability_zone_id                           = (known after apply)
      + cidr_block                                     = "10.0.1.0/24"
      + enable_dns64                                   = false
      + enable_resource_name_dns_a_record_on_launch    = false
      + enable_resource_name_dns_aaaa_record_on_launch = false
      + id                                             = (known after apply)
      + ipv6_cidr_block_association_id                 = (known after apply)
      + ipv6_native                                    = false
      + map_public_ip_on_launch                        = false
      + owner_id                                       = (known after apply)
      + private_dns_hostname_type_on_launch            = (known after apply)
      + tags                                           = {
          + "Name" = "iac-ci-cd-terraform"
        }
      + tags_all                                       = {
          + "CI"         = "true"
          + "Name"       = "iac-ci-cd-terraform"
          + "Project"    = "iac-ci-cd"
          + "Repository" = "https://github.com/clouderizando/iac-ci-cd"
          + "Terraform"  = "true"
        }
      + vpc_id                                         = (known after apply)
    }

  # module.vpc.aws_subnet.intra[2] will be created
  + resource "aws_subnet" "intra" {
      + arn                                            = (known after apply)
      + assign_ipv6_address_on_creation                = false
      + availability_zone                              = "us-east-1c"
      + availability_zone_id                           = (known after apply)
      + cidr_block                                     = "10.0.2.0/24"
      + enable_dns64                                   = false
      + enable_resource_name_dns_a_record_on_launch    = false
      + enable_resource_name_dns_aaaa_record_on_launch = false
      + id                                             = (known after apply)
      + ipv6_cidr_block_association_id                 = (known after apply)
      + ipv6_native                                    = false
      + map_public_ip_on_launch                        = false
      + owner_id                                       = (known after apply)
      + private_dns_hostname_type_on_launch            = (known after apply)
      + tags                                           = {
          + "Name" = "iac-ci-cd-terraform"
        }
      + tags_all                                       = {
          + "CI"         = "true"
          + "Name"       = "iac-ci-cd-terraform"
          + "Project"    = "iac-ci-cd"
          + "Repository" = "https://github.com/clouderizando/iac-ci-cd"
          + "Terraform"  = "true"
        }
      + vpc_id                                         = (known after apply)
    }

  # module.vpc.aws_vpc.this[0] will be created
  + resource "aws_vpc" "this" {
      + arn                                  = (known after apply)
      + cidr_block                           = "10.0.0.0/16"
      + default_network_acl_id               = (known after apply)
      + default_route_table_id               = (known after apply)
      + default_security_group_id            = (known after apply)
      + dhcp_options_id                      = (known after apply)
      + enable_dns_hostnames                 = true
      + enable_dns_support                   = true
      + enable_network_address_usage_metrics = (known after apply)
      + id                                   = (known after apply)
      + instance_tenancy                     = "default"
      + ipv6_association_id                  = (known after apply)
      + ipv6_cidr_block                      = (known after apply)
      + ipv6_cidr_block_network_border_group = (known after apply)
      + main_route_table_id                  = (known after apply)
      + owner_id                             = (known after apply)
      + tags                                 = {
          + "Name" = "iac-ci-cd-terraform"
        }
      + tags_all                             = {
          + "CI"         = "true"
          + "Name"       = "iac-ci-cd-terraform"
          + "Project"    = "iac-ci-cd"
          + "Repository" = "https://github.com/clouderizando/iac-ci-cd"
          + "Terraform"  = "true"
        }
    }

  # module.vpc_endpoints.aws_security_group.this[0] will be created
  + resource "aws_security_group" "this" {
      + arn                    = (known after apply)
      + description            = "VPC endpoint security group"
      + egress                 = (known after apply)
      + id                     = (known after apply)
      + ingress                = (known after apply)
      + name                   = (known after apply)
      + name_prefix            = "iac-ci-cd-terraform-vpc-endpoints-"
      + owner_id               = (known after apply)
      + revoke_rules_on_delete = false
      + tags                   = {
          + "Name" = "iac-ci-cd-terraform-vpc-endpoints-"
        }
      + tags_all               = {
          + "CI"         = "true"
          + "Name"       = "iac-ci-cd-terraform-vpc-endpoints-"
          + "Project"    = "iac-ci-cd"
          + "Repository" = "https://github.com/clouderizando/iac-ci-cd"
          + "Terraform"  = "true"
        }
      + vpc_id                 = (known after apply)
    }

  # module.vpc_endpoints.aws_security_group_rule.this["ingress_https"] will be created
  + resource "aws_security_group_rule" "this" {
      + cidr_blocks              = [
          + "10.0.0.0/24",
          + "10.0.1.0/24",
          + "10.0.2.0/24",
        ]
      + description              = "HTTPS from subnets"
      + from_port                = 443
      + id                       = (known after apply)
      + protocol                 = "tcp"
      + security_group_id        = (known after apply)
      + security_group_rule_id   = (known after apply)
      + self                     = false
      + source_security_group_id = (known after apply)
      + to_port                  = 443
      + type                     = "ingress"
    }

  # module.vpc_endpoints.aws_vpc_endpoint.this["ec2messages"] will be created
  + resource "aws_vpc_endpoint" "this" {
      + arn                   = (known after apply)
      + cidr_blocks           = (known after apply)
      + dns_entry             = (known after apply)
      + id                    = (known after apply)
      + ip_address_type       = (known after apply)
      + network_interface_ids = (known after apply)
      + owner_id              = (known after apply)
      + policy                = (known after apply)
      + prefix_list_id        = (known after apply)
      + private_dns_enabled   = true
      + requester_managed     = (known after apply)
      + route_table_ids       = (known after apply)
      + security_group_ids    = (known after apply)
      + service_name          = "com.amazonaws.us-east-1.ec2messages"
      + state                 = (known after apply)
      + subnet_ids            = (known after apply)
      + tags                  = {
          + "Name" = "iac-ci-cd-terraform-ec2messages"
        }
      + tags_all              = {
          + "CI"         = "true"
          + "Name"       = "iac-ci-cd-terraform-ec2messages"
          + "Project"    = "iac-ci-cd"
          + "Repository" = "https://github.com/clouderizando/iac-ci-cd"
          + "Terraform"  = "true"
        }
      + vpc_endpoint_type     = "Interface"
      + vpc_id                = (known after apply)

      + timeouts {
          + create = "10m"
          + delete = "10m"
          + update = "10m"
        }
    }

  # module.vpc_endpoints.aws_vpc_endpoint.this["ssm"] will be created
  + resource "aws_vpc_endpoint" "this" {
      + arn                   = (known after apply)
      + cidr_blocks           = (known after apply)
      + dns_entry             = (known after apply)
      + id                    = (known after apply)
      + ip_address_type       = (known after apply)
      + network_interface_ids = (known after apply)
      + owner_id              = (known after apply)
      + policy                = (known after apply)
      + prefix_list_id        = (known after apply)
      + private_dns_enabled   = true
      + requester_managed     = (known after apply)
      + route_table_ids       = (known after apply)
      + security_group_ids    = (known after apply)
      + service_name          = "com.amazonaws.us-east-1.ssm"
      + state                 = (known after apply)
      + subnet_ids            = (known after apply)
      + tags                  = {
          + "Name" = "iac-ci-cd-terraform-ssm"
        }
      + tags_all              = {
          + "CI"         = "true"
          + "Name"       = "iac-ci-cd-terraform-ssm"
          + "Project"    = "iac-ci-cd"
          + "Repository" = "https://github.com/clouderizando/iac-ci-cd"
          + "Terraform"  = "true"
        }
      + vpc_endpoint_type     = "Interface"
      + vpc_id                = (known after apply)

      + timeouts {
          + create = "10m"
          + delete = "10m"
          + update = "10m"
        }
    }

  # module.vpc_endpoints.aws_vpc_endpoint.this["ssmmessages"] will be created
  + resource "aws_vpc_endpoint" "this" {
      + arn                   = (known after apply)
      + cidr_blocks           = (known after apply)
      + dns_entry             = (known after apply)
      + id                    = (known after apply)
      + ip_address_type       = (known after apply)
      + network_interface_ids = (known after apply)
      + owner_id              = (known after apply)
      + policy                = (known after apply)
      + prefix_list_id        = (known after apply)
      + private_dns_enabled   = true
      + requester_managed     = (known after apply)
      + route_table_ids       = (known after apply)
      + security_group_ids    = (known after apply)
      + service_name          = "com.amazonaws.us-east-1.ssmmessages"
      + state                 = (known after apply)
      + subnet_ids            = (known after apply)
      + tags                  = {
          + "Name" = "iac-ci-cd-terraform-ssmmessages"
        }
      + tags_all              = {
          + "CI"         = "true"
          + "Name"       = "iac-ci-cd-terraform-ssmmessages"
          + "Project"    = "iac-ci-cd"
          + "Repository" = "https://github.com/clouderizando/iac-ci-cd"
          + "Terraform"  = "true"
        }
      + vpc_endpoint_type     = "Interface"
      + vpc_id                = (known after apply)

      + timeouts {
          + create = "10m"
          + delete = "10m"
          + update = "10m"
        }
    }

Plan: 22 to add, 0 to change, 0 to destroy.

─────────────────────────────────────────────────────────────────────────────

Note: You didn't use the -out option to save this plan, so Terraform can't
guarantee to take exactly these actions if you run "terraform apply" now.

```

</details>

*Pusher: @melquiadesrodrigues, Action: `pull_request`, Working Directory: ``, Workflow: `ci-change terraform`*